app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."status" = $2 ORDER BY created_at DESC  [["user_id", 1], ["status", "t"]]
SELECT  "items".* FROM "items" WHERE "items"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
	def index
		if user_signed_in?
			if params[:complete]
				@items = Item.where(:user_id => current_user.id).where(:status => params[:complete]).order("created_at DESC")
			else
				@items = Item.where(:user_id => current_user.id).order("created_at DESC")

INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Current user item"], ["description", "current user item description"], ["created_at", "2017-09-26 04:09:42.200209"], ["updated_at", "2017-09-26 04:09:42.200209"], ["user_id", 1]]
---
	def create
		@item = current_user.items.build(item_params)

		if @item.save

UPDATE "items" SET "title" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["title", "Second Items"], ["updated_at", "2017-09-26 02:01:07.834122"], ["id", 2]]
---
	def update

		if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "completed_at" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["completed_at", "2017-09-26 05:49:53.721900"], ["updated_at", "2017-09-26 05:49:53.723615"], ["id", 1]]
---
	def complete
		@item = Item.find(params[:id])
		if @item.completed_at == nil
			@item.update_attribute(:completed_at,Time.now)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
		def find_item
			@item = Item.find(params[:id])